一、单选题
1、编译Java Application 源程序文件将产生相应的字节码文件，这些字节码文件的扩展名为( )。
B.class

2、设 x = 1 , y = 2 , z = 3，则表达式 y＋＝z－－/＋＋x 的值是( )。
A.3

3、不允许作为类及类成员的访问控制符的是( )。
C. static

4、为AB类的一个无形式参数无返回值的方法method书写方法头，使得使用类名AB作为前缀就可以调用它，该方法头的形式为( )
A. static void method( ) 

5、给定java 代码如下，编译运行后，输出结果是()(选择一项）。  
C.2

6．设有定义语句“int a[]={66,88,99};”，则以下对此语句的叙述错误的是（ ）
C．a数组的下标为1～3

7．设有定义“int[] a=new int[4];”则数组a的所有元素是（ ）
B．a[0]、a[1]、a[2]、a[3]

8．下面哪个选项正确地声明了一个字符串数组 （ ）
C．String[] str

9、假设有这样的数组创建：int a[]={1,2,3,4,5,6,7};则该数组长度为 ( )。
D.7

10、下列二维数组的创建中错误的是( )。
D．int [][] a=new int[][];

11 方法内定义的变量（ ）。
B．可能在方法的局部位置可见

12 方法的形参（ ）。
A．可以没有

13 return语句（ ）。
D．一个方法中可以有多个

14．main()方法的返回值类型是( )
C．void

15．编译并运行下面的程序，运行结果是（ ）。
A．程序可以编译运行，输出结果为：“int:  8”    

16．能作为类及其成员的修饰符是（ ）。
D．public

17．下列方法定义中，方法头不正确的是（）。
A．public static x(double a){…}

18．构造方法在（ ）时被调用。
D．创建对象时

19．下列哪个类声明是正确的（ ）。
A．public abstract class Car{…}

20．下列不属于面向对象程序设计的基本特征的是（）。
D．静态

21．请看下面的程序
C．this(n,a)//调用的是第二个有参构造函数

22．请看下面的程序段
C．将 private int m 改成 static int m

24.有一个类A，对于其构造函数的声明正确的是（ ）。
B．public A(int x){…}

25．请看下面的程序段
B．输出 0

26关键字（）表明一个对象或变量在初始化后不能修改。
B．final

27．声明为static的方法不能访问（ ）类成员。
C．非 static

28．定义类A如下：（重要）
C．public void B(int x,int y){ a=x;b=y;c=0;}

29．编译运行下面的程序，结果是（ ）。（重要）
B．代码可以编译运行，并输出结果：AB

30．已知类关系如下：
A．Employee e=new Manager();

31．接口是Java面向对象的实现机制之一，以下说法正确的是（
A．Java 支持多重继承，一个类可以实现多个接口

32．下列方法的声明中不合法的是( )
C．area{…}

33、下面哪个包是编程时不需要导入就可以直接使用的( )
B．java.lang

34、调用构造方法是在( )
B．创建对象时

35、在子类构造方法的哪个地方可以调用其父类的构造方法( )
B．构造方法的第一条语句

36、关于Java中的继承，下列说法错误的是( )
D．继承一般有多重继承和单一继承两种方式，在单一继承中每一个类最多只有一个父类，而多重继承则可以有多个父类。Java 中的类都采用多重继承。

37、当方法中的局部变量与成员变量同名时，必须使用下列哪一个关键字指出成员变量( )
C．this

38、什么样的方法不能被重写( )
B．最终（final）方法

39、下列程序运行的结果是( )
A．good

40、下列类的声明中不合法的是( )
A．class People（）{…}

41、能作为类的修饰符, 也能作为类成员的修饰符的是( )
A．public

42、试完成下述程序片段( )
B．this.x   this.y

43、在JAVA 中，下列说法正确的是：( )
C．一个子类只可以有一个父类，但一个父类可以有多个子类

44、Father和Son是两个java类，下列哪一选项正确的标识出Father是Son的父类( )  
D．class Son extends Father

45、重载指的是方法具有相同的名字，但这些方法的参数必须不同。下列哪种说法不属于方法参数的不同( )
C．形式参数的名字不同。

46、下列有关抽象类与接口的叙述中正确的是哪一个（ ）


47、从下列程序中你发现了几处错误( )


48、关于接口的定义和实现，以下描述正确的是( )


49.char类型的整数范围是（ ）
B. 0 ... 65535 

50.以下程序正确的输出是（ ）


二、填空题
1．如果一个方法不返回任何值，则该方法的返回值类型为(void)。

2．如果子类中的某个方法名、返回值类型和(传递参数)与父类中的某个方法完全一致，则称子类中的这个方法覆盖了父类的同名方法。

3．接口中所有的属性均为(公有)、(静态)和(常量)的

4．(抽象)方法是一种仅有方法声明，没有具体方法体和操作实现的方法，该方法必须在(抽象)类之中定义。

5．在Java程序中，通过类的定义只能实现(单重)继承，但通过(接口)的定义可以实现多重继承关系。

三、简答题
1、什么是继承？
继承是面向对象三大特征之一,java中的继承描述的是两个类之间的关系，被继承的类称为父类，继承的类成为子类

2、请简述重载和重写的区别？
方法重写要求参数签名必须一致，而重载要求参数签名必须不一致。
方法重写要求返回类型必须一致，而重载对此不做限制。
方法重写只能用于子类重写父类的方法，必须有两个类子类和父类，重载可用于同一个类的所有方法。

3.抽象类和接口的区别
修饰关键字的不同,接口只能用public,抽象类都可以
多继承,接口可以多继承,接口不能
实现方法不同,抽象类是通过继承extends,接口是通过实现implements
接口不能有main方法,抽象类可以有main方法
接口没有构造方法,抽象类有构造方法,可以初始化一些属性
速度,接口速度比较慢,抽象类的速度比较快

4.分别解释一下this,super,final,static 关键字 越详细越好
this关键字用于引用类的当前实例
super关键字用于从子类访问父类的变量和方法
final关键字主要用在三个地方：变量、方法、类。
1.对于一个final变量，如果是基本数据类型的变量，则其数值一旦在初始化之后便不能更改；如果是引用类型的变量，则在对其初始化之后便不能再让其指向另一个对象。
2.当用final修饰一个类时，表明这个类不能被继承。final类中的所有成员方法都会被隐式地指定为final方法。
3.使用final方法的原因有两个。第一个原因是把方法锁定，以防任何继承类修改它的含义；第二个原因是效率。在早期的Java实现版本中，会将final方法转为内嵌调用。但是如果方法过于庞大，可能看不到内嵌调用带来的任何性能提升（现在的Java版本已经不需要使用final方法进行这些优化了）。类中所有的private方法都隐式地指定为final。
static 关键字有以下四种使用场景：
1.修饰成员变量和成员方法: 被 static 修饰的成员属于类，不属于单个这个类的某个对象，被类中所有对象共享，可以并且建议通过类名调用。被static 声明的成员变量属于静态成员变量，静态变量 存放在 Java 内存区域的方法区。调用格式：类名.静态变量名 类名.静态方法名()
2.静态代码块: 静态代码块定义在类中方法外, 静态代码块在非静态代码块之前执行(静态代码块—>非静态代码块—>构造方法)。 该类不管创建多少对象，静态代码块只执行一次.
3.静态内部类（static修饰类的话只能修饰内部类）： 静态内部类与非静态内部类之间存在一个最大的区别: 非静态内部类在编译完成之后会隐含地保存着一个引用，该引用是指向创建它的外围内，但是静态内部类却没有。没有这个引用就意味着：1. 它的创建是不需要依赖外围类的创建。2. 它不能使用任何外围类的非static成员变量和方法。
4.静态导包(用来导入类中的静态资源，1.5之后的新特性): 格式为：import static 这两个关键字连用可以指定导入某个类中的指定静态资源，并且不需要使用类名调用类中静态成员，可以直接使用类中静态成员变量和成员方法。

5.什么是类？什么是对象？类和对象有何联系？
在面向对象程序设计里，类是定义一个对象的属性和方法的蓝本。对象就是一组变量和相关方法的集合，其中变量表明对象的状态，方法表明对象所具有的行为。类是对象的模板，对象是类的实例，可以从一个类中创建许多对象。

6.方法的重载和方法的覆盖有什么不同？
方法重载，指的是在类中创建多个具有相同名称，但使用不同参数的方法，Java虚拟机根据传递给方法的参数个数和类型决定调用哪个重载方法。方法的覆盖指在子类中重新定义父类中已有的方法，对于重写的方法，运行时系统根据调用该方法的实例的类型来决定选择哪个方法调用。

7.类变量和实例变量有何区别？
类变量是所有对象共有，其中一个对象将它值改变，其他对象得到的就是改变后的结果；而实例变量则属对象私有，某一个对象将其值改变，不影响其他对象。

8.Java的成员变量修饰符有哪几种？(写出吴中)其中哪种修饰符限定的范围最大？
public、protected、private、static、final。Public修饰符的限定范围最大。

9.说明对象的基本概念和主要特征？
对象是对客观世界实体及其实体关系的抽象。特点：（1）以数据为中心；(2)实现了数据封装；（3）模块独立性好；（4）对象是主动的；（5）本质上具有并行性。





















































































